УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПечатьЭтикетокИЦенников/ПечатьЭтикетокИЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПечатьЭтикетокИЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПравилоОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РежимПолученияЦен</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВидЦеныДополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>ИсходныеДанныеТовары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЭтикетки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоВДокументе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ШаблонЦенника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОстатокНаСкладе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЦенаДополнительно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоЦенников</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоЭтикеток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt.РасширениеСмарт/src/DataProcessors/ПечатьЭтикетокИЦенников/Forms/ФормаТовары/Module.bsl
#Область ПеренесеноСДоработками

&НаСервере
&После("УстановитьУсловноеОформление")
Процедура смарт_УстановитьУсловноеОформление()
	// Фролов+
	Элемент=УсловноеОформление.Элементы.Добавить();
	
	Поле=Элемент.Поля.Элементы.Добавить();
	Поле.Поле=Новый ПолеКомпоновкиДанных(Элементы.ТоварыСерия.Имя);
	
	Отбор=Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Объект.Товары.СерииИспользуются");
	Отбор.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение=Ложь;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<серия не указывается>'"));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	// Фролов-
КонецПроцедуры

&НаСервере
&После("УстановитьОбязательныеПоляДанных")
Процедура смарт_УстановитьОбязательныеПоляДанных(СтруктураНастроек, ДобавитьШаблоны)
	// Фролов+
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда 
		СтруктураНастроек.ОбязательныеПоля.Добавить("Серия");
	КонецЕсли;	
	// Фролов-
КонецПроцедуры

&НаСервере
&Вместо("ПриИзмененииНоменклатуры")
Функция смарт_ПриИзмененииНоменклатуры(ТекущиеДанные)
	Результат = ПродолжитьВызов(ТекущиеДанные);
	// Фролов+ Добавляем признак использования Серии
	Результат.Вставить("СерииИспользуются",ТекущиеДанные.Номенклатура.ВидНоменклатуры.ИспользоватьСерии);
	// Фролов-
	Возврат Результат;
КонецФункции

#КонецОбласти


#Область ДоработкиСмарт

&НаКлиенте
Процедура смартУстановитьКоличествоПоОстаткам(Команда)
	смартУстановитьКоличествоПоОстаткамСервер();
КонецПроцедуры

&НаСервере
Процедура смартУстановитьКоличествоПоОстаткамСервер()
	Для Каждого Стр Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(Стр.Характеристика) Тогда 
			Остаток=Цел(Стр.ОстатокНаСкладе/СтрокуВЧисло(Стр.Характеристика.Наименование));
		Иначе
			Остаток=?(Стр.ОстатокНаСкладе%1,1,Стр.ОстатокНаСкладе);  // Если на остатке не целое число тогда Остаток = 1
		КонецЕсли;	

		Стр.КоличествоЭтикеток=Остаток;
	КонецЦикла;	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция СтрокуВЧисло(Стр)
	Попытка
		Возврат Число(Стр);
	Исключение
		Возврат 1;
	КонецПопытки;	
КонецФункции	

#КонецОбласти
